//==============================================================================
//includes:

#include "Common/xTypes.h"
//==============================================================================
//functions:

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    (void)xTask;
    (void)pcTaskName;

    // Здесь можно выполнить действия при обнаружении переполнения стека
    // Например, отправить отладочное сообщение или принять другие меры
}
//==============================================================================
